// Week_11-12_Zadanie-2.cpp 
//2. Создайте структуру для хранения комплексных чисел. Атрибуты: вещественная и
//мнимая части.Объявите два числа и получите их значения от пользователя
//f. Напишите функцию, которая будет сравнивать вещественную часть
//комплексного числа.


#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}

