// Week_3-4_Zadanie-6.cpp 
//10. Составить алгоритм (возможно, не самый оптимальный), находящий три
//натуральных числа X, Y, Z, удовлетворяющих условию : 15ݔ + 20ݕ + 30ݖ = 270

#include <iostream>

int main()
{
    for (int x=1; x < 270 / 15; x++)
    {
        for(int y=1;y<270/20;y++)
        {
            for (int z=1; z < 270 / 30; z++)
            {
                if(15*x+20*y+30*z==270)
                std::cout << "x="<< x << "\t" << "y="<< y << "\t" << "z="<< z << "\n" ;
            }
        }
    }


}

