//1. Вывести на экран Первую букву имени из символов "*" (звездочка)

#include <iostream>

int main()
{
    std::cout << "*******\n"
        <<"*\t*\n*\t*\n*\t*\n*\t*\n*******\n"
        <<"*\t*\n*\t*\n*\t*\n*\t*\n*\t*\n*******\n";

    std::getchar();
}